In [8]:
import pandas as pd

# suppose if you have an extra column at start or you want to skip first row and start reading from 2nd row, then use skiprows= 1 it will skip the first row.
# We can also use header = 1 to start reading from first, if there is no headers then use header = None. Using this it will automatically provide col name like 0,1,2,3 etc
# if you want to name the cols use header = None , names =["header1", "header 2"]

In [9]:
df= pd.read_csv("03_read_write.csv", skiprows= None)
df

  tickers            eps  revenue price      people
0   googl          27.27       50   666  larry page
1     wdd             12       60    55        n.a.
2      ww             13       40   433        usjm
3     fgd             -1       50    66      asuhjd
4     tyr  not available       -1   788        jsss
5    tata            5.6       30   n.a  ratan tata

# if you have N.A or not available as a values in csv file then use na_values =["not available", "n.a."] . Usin this it will replace all not available or n.a. values in your csv file with NAN
# it will help data cleaning activity

In [10]:
df= pd.read_csv("03_read_write.csv", na_values=["not available", "n.a.", "n.a"])
df

  tickers    eps  revenue  price      people
0   googl  27.27       50  666.0  larry page
1     wdd  12.00       60   55.0         NaN
2      ww  13.00       40  433.0        usjm
3     fgd  -1.00       50   66.0      asuhjd
4     tyr    NaN       -1  788.0        jsss
5    tata   5.60       30    NaN  ratan tata

# if you want to update negative values to NAN then use dictionary to the specific col where you want to upgrade it to NAN

In [12]:
df= pd.read_csv("03_read_write.csv", na_values= {
"eps": ["not available", "n.a.", "n.a"],
"revenue": ["not available", "n.a.", "n.a", -1],
"price": ["not available", "n.a.", "n.a"],
"people": ["not available", "n.a.", "n.a"]
})
df

  tickers    eps  revenue  price      people
0   googl  27.27     50.0  666.0  larry page
1     wdd  12.00     60.0   55.0         NaN
2      ww  13.00     40.0  433.0        usjm
3     fgd  -1.00     50.0   66.0      asuhjd
4     tyr    NaN      NaN  788.0        jsss
5    tata   5.60     30.0    NaN  ratan tata

# if you want to write above datasets into new cs file then use df.to_csv("filename). 
# by default it will write index too, but to avoid it just pass index= False

In [16]:
df.to_csv("03_writing_to_csv_file.csv", index=False)

# if you want to write specific columns then use columns argument and pass column name
# also if you want skip header name for writing into csv then use header = false

In [20]:
df.columns
df.to_csv("03_writing_few_cols.csv", index=False,header=False, columns=["tickers", "eps"])

# if you want to read 3 rows then use nrows= 3 for eg

In [11]:
df= pd.read_csv("03_read_write.csv", nrows=3)
df

  tickers    eps  revenue  price      people
0   googl  27.27       50    666  larry page
1     wdd  12.00       60     55        n.a.
2      ww  13.00       40    433        usjm